```
# module.secrets.aws_ssm_parameter.secret_parameters["."] will be created
  + resource "aws_ssm_parameter" "secret_parameters" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "."
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "3890acb0-0dc1-4927-975f-a2492279174b"
      + name           = "/psc-delta-consumer-cidev/."
      + overwrite      = true
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
successfully run tf runners, pr ready for review.